In [1]:
# Imports

In [2]:
import pandas as pd

In [3]:
# import csvs we'll be working with

In [4]:
dataFile_one = pd.read_csv("C:\\Users\\Administrator\\Desktop\\screenshotsOfBetway\\results.csv")
dataFile_two = pd.read_csv("C:\\Users\\Administrator\\Desktop\\screenshotsOfBetway\\results_2024-07-23.csv")
dataFile_three = pd.read_csv("C:\\Users\\Administrator\\Desktop\\screenshotsOfBetway\\results_2024-07-28.csv")
dataFile_four = pd.read_csv("C:\\Users\\Administrator\\Desktop\\screenshotsOfBetway\\results_2024-07-30.csv")

In [5]:
# Combine everything into one thing

In [6]:
working_data = pd.concat([dataFile_one,dataFile_two,dataFile_three,dataFile_four])

In [7]:
working_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8046 entries, 0 to 3214
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        8045 non-null   object
 1   Start Time  8045 non-null   object
 2   End Time    8045 non-null   object
 3   Total Bets  7037 non-null   float64
 4   Value       8021 non-null   object
dtypes: float64(1), object(4)
memory usage: 377.2+ KB

In [8]:
working_data["Date"] = pd.to_datetime(working_data["Date"])
working_data = working_data.dropna()
working_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7013 entries, 0 to 3214
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        7013 non-null   datetime64[ns]
 1   Start Time  7013 non-null   object
 2   End Time    7013 non-null   object
 3   Total Bets  7013 non-null   float64
 4   Value       7013 non-null   object
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 328.7+ KB

In [28]:
working_data["Date"].sample(10)

3006   2024-07-30
2953   2024-07-22
1439   2024-07-22
1705   2024-07-30
869    2024-07-22
2744   2024-07-22
3238   2024-07-22
1110   2024-07-30
1705   2024-07-22
2750   2024-07-30
Name: Date, dtype: datetime64[ns]

In [13]:
working_data["Total Bets"] = working_data["Total Bets"].astype('int')
working_data["Value"] = working_data["Value"].str.lstrip('.')
working_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7013 entries, 0 to 3214
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        7013 non-null   datetime64[ns]
 1   Start Time  7013 non-null   object
 2   End Time    7013 non-null   object
 3   Total Bets  7013 non-null   int32
 4   Value       5740 non-null   object
dtypes: datetime64[ns](1), int32(1), object(3)
memory usage: 301.3+ KB

In [15]:
working_data["Value"].isnull().sum()

1273

In [16]:
working_data = working_data.dropna()
working_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5740 entries, 0 to 3214
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        5740 non-null   datetime64[ns]
 1   Start Time  5740 non-null   object
 2   End Time    5740 non-null   object
 3   Total Bets  5740 non-null   int32
 4   Value       5740 non-null   object
dtypes: datetime64[ns](1), int32(1), object(3)
memory usage: 246.6+ KB

In [17]:
working_data = working_data.drop([working_data[working_data["Value"] == ""].index[0]])#dropping because one of these has a "" entry
working_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5738 entries, 0 to 3214
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        5738 non-null   datetime64[ns]
 1   Start Time  5738 non-null   object
 2   End Time    5738 non-null   object
 3   Total Bets  5738 non-null   int32
 4   Value       5738 non-null   object
dtypes: datetime64[ns](1), int32(1), object(3)
memory usage: 246.6+ KB

In [18]:
working_data["Value"] = working_data["Value"].astype('float')
working_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5738 entries, 0 to 3214
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        5738 non-null   datetime64[ns]
 1   Start Time  5738 non-null   object
 2   End Time    5738 non-null   object
 3   Total Bets  5738 non-null   int32
 4   Value       5738 non-null   float64
dtypes: datetime64[ns](1), float64(1), int32(1), object(2)
memory usage: 246.6+ KB

In [19]:
dayOne = working_data[working_data["Date"] == "2024-07-22"]
dayOne["Value"].mean()

26.05441240206186

In [29]:
dayOne = working_data[working_data["Date"] == "2024-07-22"]
dayOne["Value"].median()

2.075

In [32]:
dayOne = working_data[working_data["Date"] == "2024-07-22"]
dayOne["Value"].mode()

0    1.0
Name: Value, dtype: float64

In [20]:
dayOne = working_data[working_data["Date"] == "2024-07-28"]
dayOne["Value"].mean()

nan

In [30]:
dayOne = working_data[working_data["Date"] == "2024-07-28"]
dayOne["Value"].median()

nan

In [21]:
dayOne = working_data[working_data["Date"] == "2024-07-30"]
dayOne["Value"].mean()

20.1349948019802

In [31]:
dayOne = working_data[working_data["Date"] == "2024-07-30"]
dayOne["Value"].median()

2.07

In [35]:
dayOne = working_data[working_data["Date"] == "2024-07-30"]
dayOne["Value"].mode()

0    1.0
Name: Value, dtype: float64

In [37]:
working_data["Outcome"] = working_data["Value"].apply(lambda x: 1 if x > 4 else 0)
working_data.sample(10)

           Date       Start Time         End Time  Total Bets  Value  Outcome
141  2024-07-22  00:58:26.013855  00:59:07.896133        1350  19.91        1
2909 2024-07-22  20:30:14.976895  20:30:28.872803        3333   1.71        0
1712 2024-07-22  11:25:25.603494  11:25:37.194324        3173   1.48        0
3306 2024-07-22  23:27:46.851806  23:28:43.608524        3535  54.75        1
2356 2024-07-30  16:57:50.824448  16:58:13.165187        3547   2.75        0
122  2024-07-22  00:51:21.920633  00:52:05.156284        1353  21.74        1
1373 2024-07-30  09:14:58.563747  09:15:26.535850        5020   5.24        1
1609 2024-07-22  10:40:30.012710  10:40:37.407176        2502   1.02        0
346  2024-07-30  02:23:44.543271  02:23:50.120015        2557   1.09        0
3208 2024-07-22  22:47:10.436888  22:47:24.839529        3907   1.73        0

In [38]:
working_data[working_data["Outcome"]==1].count()
# all the true where value is above 5

Date          1699
Start Time    1699
End Time      1699
Total Bets    1699
Value         1699
Outcome       1699
dtype: int64

In [39]:
working_data[working_data["Outcome"]==0].count()
# all the true where value is below 5

Date          4039
Start Time    4039
End Time      4039
Total Bets    4039
Value         4039
Outcome       4039
dtype: int64

In [40]:
1699/4039*100

42.06486754147066

In [ ]:
working_data.head(10)

In [41]:
gapCount=0
gapsBetweenWins = pd.DataFrame(columns=["win value","gap"])

for index, x in working_data.iterrows():
    #if the current one is true and the next one is false, reset gap and start all over
    if x["Outcome"] == 1:
        newRow = pd.DataFrame({"win value": x["Value"],"gap":gapCount},index=[len(gapsBetweenWins)])
        gapsBetweenWins = pd.concat([gapsBetweenWins,newRow])
        gapCount = 0
    gapCount+=1
        
gapsBetweenWins.head(10)

   win value gap
0       5.41   0
1       7.31   4
2       4.44   2
3       8.03  10
4       4.45   2
5       4.19   7
6      10.42   6
7      49.71   5
8       4.26   2
9       7.24   2

In [42]:
gapsBetweenWins["win value"].mode()

0    16.0
Name: win value, dtype: float64

In [43]:
gapsBetweenWins["win value"].mean()

73.75912301353738

In [ ]:
# working_data["Start Time"] = str(working_data['Start Time']).split(".")[0].replace(" ","")[1:]
# working_data["Start Time"] = pd.to_datetime(working_data['Start Time']).dt.time
# working_data.info()

In [ ]:
#working_data[["Total Bets","Value"]].plot(xlabel="Value",ylabel="Total Bets",kind="line",title="Graph representing total bets over time")

In [ ]:
#working_data["Value"].sample(10)

In [ ]:
working_data